# Terraform - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/shared/terraform/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/staging/runs/run-g46Bzn7vZUXFqEEE

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.common_resources.data.tfe_organization.default: Refreshing...
module.common_resources.data.tfe_organization.default: Refresh complete after 0s [id=org-5y3MEgeuSg9nz1bX]
module.common_resources.tfe_project.default: Refreshing state... [id=prj-wSpkGTJbojvpqXn2]
module.common_resources.data.tfe_workspace.default: Refreshing...
module.common_resources.module.identity.tfe_workspace.identity: Refreshing state... [id=ws-AGkwLCoXiFubZWM2]
module.common_resources.module.shared.tfe_workspace.shared: Refreshing state... [id=ws-s2V8iaFgDnTPEGGR]
module.common_resources.module.customer.tfe_workspace.customer: Refreshing state... [id=ws-medJu3yjWaoQgzxc]
module.common_resources.module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-CP9qsbmh5FK3sRDV]
module.common_resources.module.organization.tfe_workspace.organization: Refreshing state... [id=ws-zwHDTekjkNYx2m3X]
module.common_resources.module.customer.tfe_workspace.customer_api: Refreshing state... [id=ws-wq8RA1AqXcV7W1Xf]
module.common_resources.module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-YUx13wPrxoQgGMZ9]
module.common_resources.module.identity.tfe_variable.identity_upstash_api_key: Refreshing state... [id=var-KktPdjV8qbb7VdBB]
module.common_resources.module.identity.tfe_variable.identity_aws_secret_access_key: Refreshing state... [id=var-uuPdWtVNjHnELivT]
module.common_resources.module.identity.tfe_variable.identity_cockroach_api_key: Refreshing state... [id=var-w3fMyRN2ApwGKapy]
module.common_resources.module.identity.tfe_variable.identity_aws_access_key_id: Refreshing state... [id=var-FmtVAFzkd5CozfW9]
module.common_resources.module.organization.tfe_variable.organization_api_aws_access_key_id: Refreshing state... [id=var-z9TSRwxKjcHVfXHT]
module.common_resources.module.organization.tfe_variable.organization_api_cockroach_api_key: Refreshing state... [id=var-TdtNsxwqgfCacCp5]
module.common_resources.module.organization.tfe_variable.organization_api_aws_secret_access_key: Refreshing state... [id=var-X6aKrn4LoVazQTR9]
module.common_resources.module.organization.tfe_variable.organization_api_upstash_api_key: Refreshing state... [id=var-uVvdhY6omGgrsUZ4]
module.common_resources.module.shared.tfe_variable.shared_aws_secret_access_key: Refreshing state... [id=var-uTxoNbqFERMHXhbW]
module.common_resources.data.tfe_workspace.default: Refresh complete after 1s [id=ws-wwXQa69M62VYdb4M]
module.common_resources.module.shared.tfe_variable.shared_upstash_api_key: Refreshing state... [id=var-bLQfiDA7jgVD3LDD]
module.common_resources.module.shared.tfe_variable.shared_cockroach_api_key: Refreshing state... [id=var-GjLnscAfTMCWTLHS]
module.common_resources.module.shared.tfe_variable.shared_aws_access_key_id: Refreshing state... [id=var-EAXSRn3jnFJtvP77]
module.common_resources.module.organization.tfe_variable.organization_cockroach_api_key: Refreshing state... [id=var-3uPu7Xfwq2gF79hg]
module.common_resources.module.organization.tfe_variable.organization_aws_access_key_id: Refreshing state... [id=var-WEgUENedwQzW5FqA]
module.common_resources.module.organization.tfe_variable.organization_aws_secret_access_key: Refreshing state... [id=var-gEJhQv8Mi7gFkdoN]
module.common_resources.module.organization.tfe_variable.organization_upstash_api_key: Refreshing state... [id=var-J1142Z26XFaJXngs]
module.common_resources.module.identity.tfe_variable.identity_api_aws_access_key_id: Refreshing state... [id=var-bCXfiXdT87VdcrTH]
module.common_resources.module.identity.tfe_variable.identity_api_cockroach_api_key: Refreshing state... [id=var-V4P9n6dMXqBM6m4k]
module.common_resources.module.identity.tfe_variable.identity_api_upstash_api_key: Refreshing state... [id=var-ddUL9v8i1pJZ5Q9U]
module.common_resources.module.identity.tfe_variable.identity_api_aws_secret_access_key: Refreshing state... [id=var-Cm87VpP4gwQ3S1j5]
module.common_resources.module.customer.tfe_variable.customer_api_aws_access_key_id: Refreshing state... [id=var-DxkydVVfjZxSBgmp]
module.common_resources.module.customer.tfe_variable.customer_api_aws_secret_access_key: Refreshing state... [id=var-pAVGHe9L5pEigcXb]
module.common_resources.module.customer.tfe_variable.customer_api_upstash_api_key: Refreshing state... [id=var-NCnr2HVAoVbqQYLf]
module.common_resources.module.customer.tfe_variable.customer_api_cockroach_api_key: Refreshing state... [id=var-SFGgAbMpCFUGC7Pe]
module.common_resources.module.customer.tfe_variable.customer_aws_access_key_id: Refreshing state... [id=var-LVsDWMhY3RQjKzkj]
module.common_resources.module.customer.tfe_variable.customer_upstash_api_key: Refreshing state... [id=var-5n3y2Je4M6FhYmKt]
module.common_resources.module.customer.tfe_variable.customer_aws_secret_access_key: Refreshing state... [id=var-XtSVCTZuVyjqfZM3]
module.common_resources.module.customer.tfe_variable.customer_cockroach_api_key: Refreshing state... [id=var-wGam9LHFH3EAkmjz]
module.common_resources.data.tfe_variables.default: Refreshing...
module.common_resources.data.tfe_variables.default: Refresh complete after 0s [id=variables/ws-wwXQa69M62VYdb4M]
module.common_resources.module.identity.tfe_workspace.identity_api: Drift detected (update)
module.common_resources.module.identity.tfe_workspace.identity: Drift detected (update)
module.common_resources.module.organization.tfe_workspace.organization: Drift detected (update)
module.common_resources.module.organization.tfe_workspace.organization_api: Drift detected (update)
module.common_resources.module.shared.tfe_workspace.shared: Drift detected (update)
module.common_resources.module.customer.tfe_workspace.customer: Drift detected (update)
module.common_resources.module.customer.tfe_workspace.customer_api: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common_resources.module.gateway.tfe_variable.gateway_api_aws_access_key_id will be created
  + resource "tfe_variable" "gateway_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.gateway.tfe_variable.gateway_api_aws_secret_access_key will be created
  + resource "tfe_variable" "gateway_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.gateway.tfe_workspace.gateway_api will be created
  + resource "tfe_workspace" "gateway_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging_gateway_api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = "prj-wSpkGTJbojvpqXn2"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "gateway",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/gateway/infrastructure/workspaces/staging"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*